---
kind: other
id: Properties.T:Autodesk.Revit.DB.Electrical.ElectricalEquipment
source: html/8b9383f8-72db-0cdb-4c39-e681472f8143.htm
---
# ElectricalEquipment Properties

The CircuitNamingSchemeId used in the Electrical Equipment.
 The CircuitNamingSchemeId is used to retrieve the circuit naming scheme id of the Electrical Equipment.